Revit 2024 API
AreaBasedLoadData.LoadClassification Property
 The load classification of the area based load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ElementId LoadClassification { get; }
Visual Basic
Public ReadOnly Property LoadClassification As ElementId
	Get
Visual C++
public:
property ElementId^ LoadClassification {
	ElementId^ get ();
}
See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace